# условие
if(False):
    print("ok")
print("qwerty")


num = 1
# Логические операторы:
# если ровно
# print(num == 1)
# if(num == 1):
#     print("num == 1")

# если неровно
# print(num != 1)
# if(num != 1):
#     print("num != 1")

# если меньше 
# print(num < 2)
# if(num < 2):
#     print("num < 2")

# если больше 
# print(num > 2)
# if(num > 2):
#     print("num > 2")

# если меньше и ровно
# print(num <= 2)
# if(num <= 2):
#     print("num <= 2")

# если больше и ровно
# print(num >= 2)
# if(num >= 2):
#     print("num >= 2")


# if(not(num == 2)):
#     print("ok")
# print("qwerty")


# print(True and True)
# if(True and False):
#     print("ok")
# print("qwerty")

# if((True or False)and(True or False)):
#     print("ok")
# print("qwerty")



# вложенные условия
# num_inp = int(input("__"))
# if(num_inp>20 and num_inp <= 50):
#     print(num_inp)
#     if(num_inp == 15):
#         print(num_inp)
#         print(num_inp)
#         print("yes")
#     else:
#         print("not")



# иначе
# num_inp_2 = int(input("__"))
# if(num_inp_2 == 5):
#     print("yes")
# else:
#     print("not")



# цепочка условий 
# num_inp_3 = int(input("__"))
# if(num_inp_3 == 5):
#     print("ok 1")
# elif(num_inp_3 <100):
#     print("ok 2")
# elif(num_inp_3 != 10):
#     print("ok 3")
# else:
#     print("not")



# str_value = "qwerty"
# if(str_value[3] == "w"):
#     print("ok")






num_q1 = 8
print(num_q1)
num_q1 += 8 
print(num_q1)
num_q1 -= 8 
print(num_q1)
# обычное деление
num_q1 /= 8 
print(num_q1)
num_q1 *= 8 
print(num_q1)
num_q1 **= 8 
print(num_q1)
# остаток от деление
num_q1 %= 7
print(num_q1)
# деление без остатка
num_q1 //= 7
print(num_q1)





# dz:
# Задание 1. Пользователь вводит число. Определить, является ли оно четным.

# Задание 2. Пользователь вводит два числа. Вывести на 
# экран меньшее из этих чисел. 

# Задание 3. Пользователь вводит число. Определить, положительное это число, отрицательное или равно нулю.

# Задание 4. Пользователь вводит два числа. Определить, 
# равны ли эти числа, и если нет, вывести их на экран в порядке возрастания

# Задание 5. Пользователь с клавиатуры вводит 5 оценок 
# студента. Определить, допущен ли студент к экзамену. 
# Студент получает допуск, если его средний балл 3 балла 
# и выше.

# Задание 6. Пользователь вводит с клавиатуры число. Если 
# оно четное, умножить его на три, иначе — поделить на 
# два. Результат вывести на экран.

# Задание 7. Написать программу-калькулятор. Пользователь 
# вводит два числа и выбирает арифметическое действие. 
# Вывести на экран результат

# https://okpython.net/python/python_zadachnik/python_zadachnik.html#ex_9
# 9.4
# 9.5
# 9.8
# 9.9